// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3) {
//     document.write('<h1>це великий масив, в якому  3 і більше елементи</h1>');
// } else {
//     document.write('<h1>це маленький масив, в якому менше 3-х елементів</h1>');
// }


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//

// let a = 3; // - Маємо 3 числа і між ним
// let b = 35;
// let c = 13;
//
// console.log(b); //нам потрібно знайти те що посередині
//
// if (a > b && a < c) {
//     console.log(a)
// } else if (b > a && b < c) {
//     console.log(b) //Знайти, яке з них є середнім (більше одного, але менше за інше)
// } else if (c > a && c < b) {
//     console.log(c)
// } else {
//     console.log('nonono')
// }

//Перевірити, чи знаходиться перше число між двома іншими? WTF


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// let result;
// let a = 2;
// let b = 5;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// let howMany = (a + b < 4) ? 'Мало' : 'Багато';
// console.log(howMany);


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
//

// let number = -25;
// let numberChek = (number === 0) ? 'zero' : (number >= -100 && number < 0) ? 'negative' : (number > 0 && number <= 100) ? 'positve' : 'error';
// console.log(numberChek);
//
//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//

// let test = true;
// if (test===true){
//     console.log('Вірно')
// } else {
//     console.log('Невірно')
// }

// let test = false;
// if (test===true){
//     console.log('Вірно')
// } else {
//     console.log('Невірно')
// }

// let test = true;
// let result = (test===true)?'Вірно':'Невірно';
// console.log(result);

// let test = false;
// let result = (test===true)?'Вірно':'Невірно';
// console.log(result);

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//
// let js = prompt('Яка «офіційна» назва JavaScript?');
// if (js === 'ECMAScript') {
//     document.write('<h1>Правильно!</h1>');
// } else {
//     document.write('<h1>Не знаєте? ECMAScript!>');
// }

//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//
//
// let entrance = prompt('Введіть номер квартири.');
// if (entrance>=1 && entrance<=20) {
//     document.write('Заходьте у 1 підїзд')
// } else if (entrance>=21 && entrance<=48) {
//     document.write('Заходьте у 2 підїзд')
// } else if (entrance>=49 && entrance<=90) {
//     document.write('Заходьте у 3 підїзд')
// } else {
//     document.write('Ви не туди попали')
// }


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//

// let number = prompt('Enter your NUMBER');
// switch (number) {
//     case '10':
//         document.write('<h2>YEEEEEAP</h2>');
//         break;
//     default:
//         document.write('<h2>Think about it</h2>');
// }


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//

// let temp = prompt('Яка температура *C на вулиці?');
// if (temp>=10 && temp<=22) {
//     document.write('йдемо ВЧИТИСЯ')
// } else {
//     document.write('сидимо вдома і вчимося ОНЛАЙН')
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
// let number = prompt('Enter your NUMBER')
// switch (number) {
//     case '1':
//         document.write('<h2>Авто</h2>');
//         break;
//     case '2':
//     case '4':
//         document.write('<h2>Телефон</h2>');
//         break;
//     case '3':
//         document.write('<h2>Мото</h2>');
//         break;
//     case '5':
//         document.write('<h2>Навчання в OKTEN</h2>');
//         break;
//     default:
//         document.write('<h2>число не вірне</h2>');
// }